// fetchNotes :

// має виконувати запит для отримання колекції нотатків із сервера.
//  Повинна підтримувати пагінацію (через параметр сторінки) та фільтрацію за ключовим словом (пошук);

// createNote:

// має виконувати запит для створення нової нотатки на сервері. Приймає
//  вміст нової нотатки та повертає створену нотатку у відповіді;

// deleteNote:

// має виконувати запит для видалення нотатки за заданим ідентифікатором.
//  Приймає ID нотатки та повертає інформацію про видалену нотатку у відповіді.
